### Missing Values - Feature Engineering

Data Science Projects -- Dataset shld be colleced from multiple scources

What are the diffent types of missing data  

##### 1.Missing completely at Random, MCAR : 
###### There is absolutely no relationship between the data missing and any other values, observed or missing, within the dataset
Values in a data set are missing completely at random (MCAR) if the events that lead to any particular data-item being missing are independent both of observable variables and of unobservable parameters of interest, and occur entirely at random. When data are MCAR, the analysis performed on the data is unbiased; however, data are rarely MCAR.

In the case of MCAR, the missingness of data is unrelated to any study variable: thus, the participants with completely observed data are in effect a random sample of all the participants assigned a particular intervention. With MCAR, the random assignment of treatments is assumed to be preserved, but that is usually an unrealistically strong assumption in practice

Data that will be missing ---
1) Continous Data


2) Categorical data(eg:-sex)

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [6]:
df = sns.load_dataset("titanic")

In [7]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [8]:
 df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

Below dataset is the example of Missing Completely At Random (MCAR)

In [11]:
df[df['embarked'].isnull()]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
61,1,1,female,38.0,0,0,80.0,NaN,First,woman,False,B,NaN,yes,True
829,1,1,female,62.0,0,0,80.0,NaN,First,woman,False,B,NaN,yes,True

##### 2. Missing Data At Random, MDAR: Systematic missing values
There is absolutely some relationship between the data missing and any other values, observed or missing, within the dataset

From below dataset, cabin and age is the example of Missing Data At Random

In [15]:
df["deck_null"] = np.where(df['deck'].isnull(),1,0)

## find the percentage of null values
df["deck_null"].mean()

0.7721661054994389

In [16]:
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone', 'deck_null'],
      dtype='object')

In [19]:
 df.groupby(["survived"])['deck_null'].mean()

survived
0    0.877960
1    0.602339
Name: deck_null, dtype: float64